def n46members():
    members = '五百城 茉央 55396\n池田 瑛紗 55397\n一ノ瀬 美空 55390\n伊藤 理々杏 36749\n井上 和 55389\n岩本 蓮加 36750\n梅澤 美波 36751\n遠藤 さくら 48006\n岡本 姫奈 55401\n小川 彩 55392\n奥田 いろは 55394\n賀喜 遥香 48008\n掛橋 沙耶香 48009\n金川 紗耶 48010\n川﨑 桜 55400\n久保 史緒里 36753\n黒見 明香 55383\n阪口 珠美 36754\n佐藤 楓 36755\n佐藤 璃果 55384\n柴田 柚菜 48013\n菅原 咲月 55391\n清宮 レイ 48014\n田村 真佑 48015\n筒井 あやめ 48017\n冨里 奈央 55393\n中西 アルノ 55395\n中村 麗乃 36756\n林 瑠奈 55385\n松尾 美佑 55386\n向井 葉月 36757\n矢久保 美緒 48019\n山下 美月 36758\n弓木 奈於 55387\n吉田 綾乃ｸﾘｽﾃｨｰ 36759\n与田 祐希 36760'
    return members

def s46members():
    members = '一期生\n上村 莉菜 03\n小池 美波 06\n小林 由依 07\n齋藤 冬優花 08\n土生 瑞穂 14\n\n二期生\n井上 梨名 43\n遠藤 光莉 53\n大園 玲 54\n大沼 晶保 55\n幸阪 茉里乃 56\n武元 唯衣 45\n田村 保乃 46\n藤吉 夏鈴 47\n増本 綺良 57\n松田 里奈 48\n森田 ひかる 50\n守屋 麗奈 58\n山﨑 天 51\n\n三期生\n石森 璃花 59\n遠藤 理子 60\n小田倉 麗奈 61\n小島 凪紗 62\n谷口 愛季 63\n中嶋 優月 64\n的野 美青 65\n向井 純葉 66\n村井 優 67\n村山 美羽 68\n山下 瞳月 69'
    return members

def h46members():
    members = 'ポカ 000\n\n一期生\n潮 紗理菜 2\n加藤 史帆 5\n齊藤 京子 6\n佐々木 久美 7\n佐々木 美玲 8\n高瀬 愛奈 9\n高本 彩花 10\n東村 芽依 11\n\n二期生\n金村 美玖 12\n河田 陽菜 13\n小坂 菜緒 14\n富田 鈴花 15\n丹生 明里 16\n濱岸 ひより 17\n松田 好花 18\n\n三期生\n上村 ひなの 21\n髙橋 未来虹 22\n森本 茉莉 23\n山口 陽世 24\n\n四期生\n石塚 瑶季 25\n岸 帆夏 26\n小西 夏菜実 27\n清水 理央 28\n正源司 陽子 29\n竹内 希来里 30\n平尾 帆夏 31\n平岡 海月 32\n藤嶌 果歩 33\n宮地 すみれ 34\n山下 葉留花 35\n渡辺 莉奈 36'
    return members

def k46members():
    members = '上村 莉菜 03\n尾関 梨香 04\n小池 美波 06\n小林 由依 07\n齋藤 冬優花 08\n菅井 友香 11\n土生 瑞穂 14\n原田 葵 15\n守屋 茜 18\n渡辺 梨加 20\n渡邉 理佐 21\n井上 梨名 43\n関 有美子 44\n武元 唯衣 45\n田村 保乃 46\n藤吉 夏鈴 47\n松田 里奈 48\n松平 璃子 49\n森田 ひかる 50\n山﨑 天 51\n遠藤 光莉 53\n大園 玲 54\n大沼 晶保 55\n幸阪 茉里乃 56\n増本 綺良 57\n守屋 麗奈 58'
    return members
